9/data/attachments/ed0a89f1aaf02387.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d366836b-e2c0-4eb9-9fd1-af3937f5afc0</nif:username>
            <nif:friendToBeAdded>Melissa_physical_Friend_39313_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>